import castle_of_otranto from "./covers/castle_of_otranto.jpg";

export const articles = {
  18: {
    entrance: {
      heading: "XVIII век",
      text: "XVIII век является основанием для того жанра, каким мы знаем его сегодня, в основном засчёт появления готической фантастики.  Этот период ознаменовался существенным изменением литературных темах, сосредоточенных на сверхестественном, жутком, а также исследовании человеческих страхов. Готический роман возник в конце XVIII века и характеризовался использованием темных декорация, сверхъествественных элементов и  атмосферой ужаса.",
    },
    "first work": {
      heading: "Замок Отранто",
      text: "«Замок Отранто» Горация Уолпола (1794) принято считать первым произведением готической литературы. В нем рассказывается о замке с привидениями, загадочных событиях и ощущении надвигающейся гибели, что задало тон для будущих произведений.",
      image: castle_of_otranto,
    },
    "main features": {
      heading: "Основные черты",
      text: "Призраки, монстры и потусторонние существа часто играют центральные роли, в то время как персонажи часто оказываются в удаленных, зловещих местах, усиливающих чувства страха и уязвимости. Исследование безумия и человеческой психики становится повторяющимся мотивом.",
    },
    basis: {
      heading: "Основа произведений",
      text: "Фольклор, мифологические темы и легенды стали вдохновением для многих авторов XVIII века. Истории ужасов того времени отражали общественные страхи и культурные тревоги. Смешение традиционных сказаний с готическими элементами помогло создать богатую палитру литературы ужасов, которая находила отклик у читателей.",
    },
    "romanticism influence": {
      heading: "Влияние романтизма",
      text: "В конце этого же века огромное распространение получил романтизм, который подчеркивал эмоции, природу и возвышенное. Это движение оказало влияние на литературу ужасов, побуждая писателей исследовать темные аспекты человеческого опыта, а романтическое увлечение таинственным  и рациональным способствовало популярности готической прозы.",
    },
  },
  19: {
    entrance: {
      heading: "XIX век",
      text: "Some text",
    },
  },
};
