import castle_of_otranto from "./covers/castle_of_otranto.jpg";
import romanticism_image from "./romanticism_image.jpg";

export const articles = {
  18: {
    introduction: {
      heading: "XVIII век - зарождение жанра",
      text: "XVIII век является основанием для того жанра, каким мы знаем его сегодня, в основном засчёт появления готической фантастики.  Этот период ознаменовался существенным изменением литературных тем, сосредоточенных на сверхестественном, жутком, а также исследовании человеческих страхов. Готический роман возник в конце XVIII века и характеризовался использованием темных декорация, сверхъестественных элементов и  атмосферой ужаса.",
    },
    "first work": {
      heading: "Замок Отранто",
      text: "«Замок Отранто» Горация Уолпола (1794) принято считать первым произведением готической литературы. В нем рассказывается о замке с привидениями, загадочных событиях и ощущении надвигающейся гибели, что задало тон для будущих произведений.",
      images: {
        src: castle_of_otranto,
        alt: "\"Замок Отранто\"\n Гораций Уолпол (1794)",
        link: "/horror-books/catalog/0",
        author: "Гораций Уолпол",
        name: "\"Замок Отранто\"",
        width: "96px",
      }
    },
    "main features": {
      heading: "Основные черты",
      text: "Призраки, монстры и потусторонние существа часто играют центральные роли, в то время как персонажи часто оказываются в удаленных, зловещих местах, усиливающих чувства страха и уязвимости. Исследование безумия и человеческой психики становится повторяющимся мотивом.",
    },
    basis: {
      heading: "Основа произведений",
      text: "Фольклор, мифологические темы и легенды стали вдохновением для многих авторов XVIII века. Истории ужасов того времени отражали общественные страхи и культурные тревоги. Смешение традиционных сказаний с готическими элементами помогло создать богатую палитру литературы ужасов, которая находила отклик у читателей.",
    },
    "romanticism influence": {
      heading: "Влияние романтизма",
      text: "В конце этого же века огромное распространение получил романтизм, который подчеркивал эмоции, природу и возвышенное. Это движение оказало влияние на литературу ужасов, побуждая писателей исследовать темные аспекты человеческого опыта, а романтическое увлечение таинственным  и рациональным способствовало популярности готической прозы.",
      images: {
        src: romanticism_image,
        alt: "\"The Incubus Leaving Two Sleeping Women\" Henry Fuseli, Public domain, via Wikimedia Commons",
        link: "https://commons.wikimedia.org/wiki/File:Johann_Heinrich_F%C3%BCssli_014.jpg",
        name: "\"Инкуб покидает двух спящих женщин\"",
        author: "Хенри Фусели",
        width: "128px",
      },
    }
  },
  19: {
    introduction: {
      heading: "XIX век - расцвет и развитие жанра",
      text: "В XIX веке стал веком развития для жанра ужасов, когда готическая фантастика, зародившаяся в предыдущем столетии, достигла своего пика и значительно расширила свои границы. Авторы этого периода углубились в психологию персонажей, исследовали более сложные темы и создали произведения, которые до сих пор считаются классикой.",
    },
    "key works and authors": {
      heading: "Основные произведения и авторы",
      text: "\"Франкенштейн\" Мэри Шелли (1818) сегодня является классикой жанра и занимает значимое место в истории. Книга исследует такие темы как создание, отвественность и человеческая природа. В романе поднимаются философские размышления о жизни и смерти. Расцвет готики продолжился в творчестве Эдгара Аллана По, чьи рассказы, такие как \"Падение дома Ашеров\" (1839) и \"Сердце-обличитель\" (1842), раскрывали темы безумия, смерти и ужаса, оказывая огромное влияние на последующих писателей. ",
    },
    "main features": {
      heading: "Основные черты и темы",
      text: "В XIX веке продолжалось активное использование готических декораций, но акцент сместился на психологическое состояние персонажей. Авторы часто обращались к теме двойственности человеческой натуры, исследованию темных сторон личности, а также к проблемам социального неравенства и морального разложения. Популярными стали темы проклятий, тайных обществ, вампиризма и оборотничества, которые служили метафорами для выражения страхов и тревог общества.",
    },
    "influence of science and society": {
      heading: "Влияние научного прогресса и социальных перемен",
      text: "Научные открытия и технический прогресс XIX века, с одной стороны, восхищали, а с другой - внушали опасения. Это нашло отражение в литературе ужасов, где научные эксперименты и изобретения часто становились источником катастроф. Социальные изменения, индустриализация и рост городов приводили к появлению новых страхов, которые нашли отражение в произведениях.",
    },
  },
  20: {
    introduction: {
      heading: "XX век - модернизация и разнообразие",
      text: "В XX веке жанр претерпел значительные изменения, ознаменовав переход от готической традиции к новым формам и темам, адаптированным к меняющемуся миру. Развитие кинематографа значительно повлияло на популярность жанра, создав новые возможности для визуализации ужаса.",
    },
    "key works and authors": {
      heading: "Основные произведения и авторы",
      text: "В начале века продолжили свое развитие традиционные темы, но появились и новые направления. Г.Ф. Лавкрафт стал основоположником космического ужаса, в котором угроза исходила не от потусторонних сил, а от безразличной и непознаваемой вселенной. Его произведения, такие как \"Зов Ктулху\", оказали глубокое влияние на многих авторов. Развивался и поджанр психологического ужаса, где акцент делался на внутреннем мире персонажей и нагнетании атмосферы. В 1970-е начинает писать Стивен Кинг, работы которого знают даже те, кто не знаком с жанром, однако всесторонее признание он получает только в XXI веке.",
    },
    "main features": {
      heading: "Основные черты и темы",
      text: "XX век характеризовался разнообразием поджанров ужасов.  Появились произведения о зомби, пришельцах, маньяках-убийцах, а также об ужасах войны и тоталитарных режимов.  Развитие психоанализа повлияло на изображение персонажей, их мотивы и страхи. В произведениях поднимались важные в тот момент темы, такие как буллинг и социальное неравенство.",
    },
    "influence of cinema and tech": {
      heading: "Влияние кино и технологий",
      text: "Кино стало мощным инструментом для распространения жанра ужасов, создавая новые визуальные образы и атмосферу. Кинематограф позволил жанру раскрыть себя лучше всего, благодаря созданию атмосферы и различных визуальных эффектов, привлекши к жанру внимание даже тех, кто не читает книги.",
    },
  },
  21: {
    introduction: {
      heading: "XXI век - переосмысление и интерактивность",
      text: "В XXI веке жанр ужасов продолжает развиваться, адаптируясь к новым технологиям, меняющимся социальным реалиям и запросам аудитории. Появляется больше разнообразия иинтерактивности.",
    },
    "key works and authors": {
      heading: "Основные произведения и авторы",
      text: "Современные авторы часто используют элементы классического ужаса, но привносят в них новые темы и подходы. Популярность набирают произведения с элементами других жанров, например \"Носферату\" Джо Хилла сочетает в себе элементы ужасов и фэнтези. Развитие видеоигр и виртуальной реальности, открывает новые возможности для развития жанра. ",
    },
    "main features": {
      heading: "Основные черты и темы",
      text: "В XXI веке жанр ужасов затрагивает широкий спектр тем, включая проблемы глобализации, экологические катастрофы, терроризм, социальное неравенство и киберугрозы. Популярность набирает так называемый \"социальный ужас\", который фокусируется на страхах, связанных с общественными и расовыми проблемами.",
    },
    "influence of tech and social media": {
      heading: "Влияние технологий и социальных Сетей",
      text: "Развитие технологий позволяет жанру выходить за рамки просто рассказов и добавить интерактивности. Видеоигры привлекли много внимания к жанру, например \"Resident Evil\" или \"Silent Hill\" являются одними из самых культовых.",
    },
  },
};